{
"VeridianJSONResponse": {
"LogicalSectionResponse": {
  "LogicalSection": { 
    "LogicalSectionContent": {
      "LogicalSectionImagesHTML": "<div class=\"imagecontainer\" style=\"width: 638px; height: 68px\"><img alt=\"Block image\" src=\"/princetonperiodicals/cgi-bin/imageserver.pl?oid=Princetonian18760922-01.2.12&amp;colours=all&amp;ext=jpg&amp;area=1&amp;width=638\" style=\"width: 638px; height: 68px\" title=\"Block image\" /></div><div class=\"imagecontainer\" style=\"width: 644px; height: 1222px\"><img alt=\"Block image\" src=\"/princetonperiodicals/cgi-bin/imageserver.pl?oid=Princetonian18760922-01.2.12&amp;colours=all&amp;ext=jpg&amp;area=2&amp;width=644\" style=\"width: 644px; height: 1222px\" title=\"Block image\" /></div><div class=\"imagecontainer\" style=\"width: 645px; height: 1907px\"><img alt=\"Block image\" src=\"/princetonperiodicals/cgi-bin/imageserver.pl?oid=Princetonian18760922-01.2.12&amp;colours=all&amp;ext=jpg&amp;area=3&amp;width=645\" style=\"width: 645px; height: 1907px\" title=\"Block image\" /></div><div class=\"imagecontainer\" style=\"width: 653px; height: 1914px\"><img alt=\"Block image\" src=\"/princetonperiodicals/cgi-bin/imageserver.pl?oid=Princetonian18760922-01.2.12&amp;colours=all&amp;ext=jpg&amp;area=4&amp;width=653\" style=\"width: 653px; height: 1914px\" title=\"Block image\" /></div><div class=\"imagecontainer\" style=\"width: 644px; height: 446px\"><img alt=\"Block image\" src=\"/princetonperiodicals/cgi-bin/imageserver.pl?oid=Princetonian18760922-01.2.12&amp;colours=all&amp;ext=jpg&amp;area=5&amp;width=644\" style=\"width: 644px; height: 446px\" title=\"Block image\" /></div>",
      "LogicalSectionNextLogicalSectionID": "Princetonian18760922-01.2.13",
      "LogicalSectionPrevLogicalSectionID": "Princetonian18760922-01.2.11",
      
      "LogicalSectionTextHTML": "<p dir=\"auto\">MEETING OF THE AMERICAN PHILOLOGICAL ASSOCIATION.</p><p dir=\"auto\">It was our great privilege to attend, in July last, the eighth annual meeting of the American Philological Association, held in New York city. Despite the excessive heat of the period, the attendance was good, and the interest evinced, so decided, as to awaken within the bosom of every spectator, a large degree of philological zeal. Prof. Harkness, of Brown University, opened the session with a very suggestive and comprehensive paper. It was an historical survey of Philology as a Science. The paper exhibited a wide and profound acquaintance with the subject in hand, and impressed the auditors with the fact that the special study which Professor Harkness has given to Latin, has been based upon the broad and durable groundwork of Comparative Philology. Looking over the membership of the Association, we noticed that a large proportion was from our Eastern States, with a fair proportion from the South and West. We confess that we would have been glad to have seen Princeton more fully represented, and to have heard her voice mingled with that of her sister institutions, in the discussion of those high problems. Such an organization commends itself to us as one of the most useful established in our country, and one in which every classical English student must bear a direct or indirect part. We were very glad to</p><p dir=\"auto\">note the names of so many of the younger men of our colleges —their becoming modesty in the presence of their superiors, and, at the same time their freedom of approach to these superiors for counsel and kindly criticism. Some of the saddest pages in literature are the record of the gross neglect of rising literary talent on the part of well established authors ; aside from this, Disraeli's \" Calamities and Quarrels of Authors ' would have been a much shorter narrative. Such neglect is peculiarly true of American scholars. Of fraternities among those of equal ability and repute, we have, perhaps, sufficient, but far too little of the spirit of helpfulness and timely encouragement exercised by the perfected scholar toward the aspirant after similar maturity. Judging from the intrinsic worth of the papers read, the interest exhibited in their reading, and the general spirit pervading the body, no one present could fail to remark that this association was a scholarly one, seriously engaged in a most important work, and throwing together, with unwonted liberality, all their separate acquisitions. The themes discussed were alike recondite and practical. Professors Goodwin, of Harvard, and Gildersleeve, of John Hopkins', on the Greek Grammar, Prof. Packard, of Yale, on \" Grote's Theory of the Iliad ; Whitney, of Yale, on \" The Relations of the Aryan and Semitic Families of Languages,\" and March, of Lafayette, on \" English Orthography,\" and kindred subjects—such names and topics were quite enough to make us forgetful of the great heat, and to renew our devotion to English and classical studies. We have attended no association in America which seemed to partake more of the nature of a philosophic body, as that phrase is used in the German schools. It was a real \" literarische gesellschaft \"—-\"cine wissenschaft iche vereing.\" We mean by this, not simply that German authors were the principal ones quoted, inasmuch as no discussion in philology can advance far apart from such reference, but that the method, spirit and aim were largely Germanic. We are not prepared to say that the American character of the</p><p dir=\"auto\">body was lost. The scholars were American scholars ; as such, they were true to their nationality. Their investigations were their own. Still, these investigations were conducted in candid deference to German criticism and independent results were reached after the German method. The manner in which Professor Whitney assailed the views of Steinthal, Schleicher and Yon Raumer, is that which prevails in Berlin and Gottingen. These continental scholars, 'tis true have something to learn from the mental habits of the New World. This much, however, must be granted. As a nation of thinkers, they are patient, deliberate and comprehensive. If they are learning from us not to be hypercritical, we are learning from them not to be superficial, and that it is not possible or desirable that the continent of thought be traversed in seven days. American scholars are now doing a good work in that they are more willing than ever to ' hasten slowly ' toward the grand results that lie before them. The philosophic method probes to the centre and reaches out to the farthest horizon. Such a method demands time, and when thus applied, the results obtained by it must be accepted, be they what they may. Have not those adopting it a kind of right to be dogmatic in the presence of less laborious thinkers. They have toiled long enough to be justified in holding with tenacity to the fruit of their effort. Professor Harkness, in his prefatory paper, dwelt at length upon American contributions to Philology, and urged it upon every student of language to take up the work at the point now reached, and carry it on to larger limits. Perhaps, there are some among us whose tastes and talents lie in this direction. If so, what field could be more inviting? Related, on the one hand, to History, Psychology, Ethics, and even Physical Science, it is vitally connected on the other, with Literature and the Art of Expression. In the one of these we have but the written zvording o&gt;{ our thought; in the other, the logical principles on which such a wording is conducted. He, only, is fully able to appreciate literature or to aid in the</p><p dir=\"auto\">formation of a literature, who is thoroughly conversant with the laws and content of language. What can be much more important to the student desirous of excellence in English writing, than the philological study of the English tongue, in the light of all its kindred tongues ? The sceptre of the world's civilization is yet to be won and wielded by words. The Art of Expression—the Expression of Thought in Language—is to be the crowning art.</p>",
      "LogicalSectionTextWordCount": 1010,
      "LogicalSectionViewURL": "/princetonperiodicals/?a=d&d=Princetonian18760922-01.2.12"
    },
    
"LogicalSectionMetadata": {
  "LogicalSectionFirstPageID": "Princetonian18760922-01.1.5",
  "LogicalSectionID": "Princetonian18760922-01.2.12",
  "LogicalSectionTitle": "MEETING OF THE AMERICAN PHILOLOGICAL ASSOCIATION.",
  "LogicalSectionType": "ARTICLE"
}
,
    
"DocumentMetadata": {
  "DocumentDate": "22 September 1876",
  
  "DocumentID": "Princetonian18760922-01",
  "DocumentNumber": "3",
  "DocumentTitle": "Princetonian",
  "DocumentType": "NEWSPAPER"
  ,"DocumentVolume": "1"
}
,
    
"PublicationMetadata": {
  "PublicationID": "Princetonian",
  "PublicationTitle": "Daily Princetonian"
}

  }
}
}
}